// quizData.js
export const questions = [
  "מה אפשר לעשות באתר המכללה?",
  "כמה פרטי מידע יש בספרייה הלאומית לחירום?",
  "מהו 'מעגל ההכשרה השלם'?",
  "כמה זמן נמשכת הכשרת סע\"ר לכיתות י'?",
  "מהן ראשי התיבות רח\"ל?",
  "לפי כמות הדגלים שהופיעו בפרק הקש\"ח, נציגים מכמה מדינות ביקרו אצלינו?",
  "כמה גנרלים ספרדים היו פה?",
  "מה עשתה המכללה בזמן המלחמה?",
  "כמה מלונות ניהל משל\"ט ינאי בשיא במהלך מלחמת 'חרבות ברזל?",
  "מה הסלוגן של נווה איתנים?"
];

export const answers = [
  ["א. להירשם להכשרות", "ב. ללמוד על פעילויות המכללה", "ג. לחפש תוכן מקצועי", "ד. כל התשובות נכונות"],
  ["א. כ-1,000 פריטים", "ב. כ-1,250", "ג. כ-1,500", "ד. מעל 1,700"],
  ["א. מעגל שאם מסתובבים בו מספיק פעמים, גשם מתחיל לרדת", "ב. מעגל ההכשרות שעוברות על מנהלי המכלולים שמגיעים למכללה", "ג. המעגל שעובר דרך התורה, ההכשרה ואימון במכללה והיכולת ללמוד מהשטח ולהשתפר תו\"כ תנועה", "ד. כל מגמה בנפרד על מעגל הכשרה אחד, כשכל אחד משפיע רק בתחומו"],
  ["א. יום אחד", "ב. 11 שעות", "ג. שני ימי הכשרה", "ד. חצי יום בלחץ"],
  ["א. רשת חירום לישראל", "ב. רשת חברים לאומית", "ג. רשות החירום הלאומית", "ד. רשות החירום לישראל"],
  ["א. 6", "ב. 7", "ג. 9", "ד. 11"],
  ["א. ארבעה", "ב. חמישה", "ג. שישה", "ד. הם היו אמריקאים, לא מספרד"],
  ["א. ביצוע 'זמן יקר' במפקדות", "ב. הפצת שיעור דיגיטלי של הצח\"י", "ג. אירחה את שר התיירות, שר המדע ואת כל נציגי וועדת חוץ וביטחון", "ד. כל התשובות נכונות"],
  ["א. 465", "ב. 564", "ג. 456", "ד. 546"],
  ["א. הכי מוכנה בארץ", "ב. איתנים ונהנים", "ג. הכי מוכנים לחירום", "ד. הכי מוכנים במדינה"]
];

export const correctAnswers = [
  "ד. כל התשובות נכונות",
  "ג. כ-1,500",
  "ג. המעגל שעובר דרך התורה, ההכשרה ואימון במכללה והיכולת ללמוד מהשטח ולהשתפר תו\"כ תנועה",
  "ג. שני ימי הכשרה",
  "ג. רשות החירום הלאומית",
  "ד. 11",
  "ג. שישה",
  "ד. כל התשובות נכונות",
  "ג. 456",
  "ד. הכי מוכנים במדינה"
];
